IDEA Open Model
MatSteelEc2.DiagramType Property
Compatible with IDEA StatiCa 20.1
 Type of material diagram
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public SteelDiagramType DiagramType { get; set; }
Public Property DiagramType As SteelDiagramType
	Get
	Set
Property Value
Type: SteelDiagramType
See Also
Reference
MatSteelEc2 Class
IdeaRS.OpenModel.Material Namespace